robovero/firmware/src/wrap/_lpc17xx_gpio.c
	FIO_HalfWordSetValue(portNum, halfwordNum, bitValue);
	return 0;
}

int _FIO_ByteClearValue(uint8_t * args)
{
	uint8_t * arg_ptr;
	uint8_t portNum;
	uint8_t byteNum;
	uint8_t bitValue;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	portNum = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	byteNum = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	bitValue = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);

	FIO_ByteClearValue(portNum, byteNum, bitValue);
	return 0;
}

int _FIO_ByteReadValue(uint8_t * args)
{
	uint8_t * arg_ptr;
	uint8_t portNum;
	uint8_t byteNum;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	portNum = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	byteNum = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) FIO_ByteReadValue(portNum, byteNum));
	writeUSBOutString(str);
	return 0;
}

int _GPIO_ClearValue(uint8_t * args)
{
	uint8_t * arg_ptr;
	uint8_t portNum;
	uint32_t bitValue;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	portNum = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	bitValue = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);

	GPIO_ClearValue(portNum, bitValue);
	return 0;
}

int _FIO_ClearValue(uint8_t * args)
{
	uint8_t * arg_ptr;
	uint8_t portNum;
	uint32_t bitValue;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	portNum = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	bitValue = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);

	FIO_ClearValue(portNum, bitValue);
	return 0;
}

int _FIO_SetDir(uint8_t * args)
{
	uint8_t * arg_ptr;
	uint8_t portNum;
	uint32_t bitValue;
	uint8_t dir;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	portNum = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	bitValue = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	dir = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);

	FIO_SetDir(portNum, bitValue, dir);
	return 0;
}

int _FIO_SetMask(uint8_t * args)
{
	uint8_t * arg_ptr;
	uint8_t portNum;
	uint32_t bitValue;
	uint8_t maskValue;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	portNum = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	bitValue = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	maskValue = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);

	FIO_SetMask(portNum, bitValue, maskValue);
	return 0;
}

int _FIO_HalfWordReadValue(uint8_t * args)
{
	uint8_t * arg_ptr;
	uint8_t portNum;
	uint8_t halfwordNum;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	portNum = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	halfwordNum = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) FIO_HalfWordReadValue(portNum, halfwordNum));
	writeUSBOutString(str);
	return 0;
}

int _FIO_ByteSetMask(uint8_t * args)
{
	uint8_t * arg_ptr;
	uint8_t portNum;
	uint8_t byteNum;
	uint8_t bitValue;
	uint8_t maskValue;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	portNum = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	byteNum = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	bitValue = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	maskValue = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);

	FIO_ByteSetMask(portNum, byteNum, bitValue, maskValue);
	return 0;
}

int _FIO_ReadValue(uint8_t * args)
{
	uint8_t * arg_ptr;
	uint8_t portNum;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	portNum = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) FIO_ReadValue(portNum));
	writeUSBOutString(str);
	return 0;
}

int _GPIO_SetValue(uint8_t * args)
{
	uint8_t * arg_ptr;
	uint8_t portNum;
	uint32_t bitValue;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	portNum = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	bitValue = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);

	GPIO_SetValue(portNum, bitValue);
	return 0;
}

int _FIO_HalfWordSetMask(uint8_t * args)
{
	uint8_t * arg_ptr;
	uint8_t portNum;
	uint8_t halfwordNum;
	uint16_t bitValue;
	uint8_t maskValue;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	portNum = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	halfwordNum = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	bitValue = (uint16_t) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	maskValue = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);

	FIO_HalfWordSetMask(portNum, halfwordNum, bitValue, maskValue);
	return 0;
}

int _GPIO_SetDir(uint8_t * args)
{
	uint8_t * arg_ptr;
	uint8_t portNum;
	uint32_t bitValue;
	uint8_t dir;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	portNum = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	bitValue = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	dir = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);

	GPIO_SetDir(portNum, bitValue, dir);
	return 0;
}

int _GPIO_Byte_TypeDef_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(GPIO_Byte_TypeDef)));
	writeUSBOutString(str);
	return 0;
}

/*int _GPIO_Byte_TypeDef_FIODIR[4](uint8_t * args)
{
	uint8_t * arg_ptr;
	GPIO_Byte_TypeDef* GPIO_Byte_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	GPIO_Byte_TypeDef_ptr = (GPIO_Byte_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) GPIO_Byte_TypeDef_ptr->FIODIR[4]);
		writeUSBOutString(str);
		return 0;
	}

	GPIO_Byte_TypeDef_ptr->FIODIR[4] = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _GPIO_Byte_TypeDef_FIOMASK[4](uint8_t * args)
{
	uint8_t * arg_ptr;
	GPIO_Byte_TypeDef* GPIO_Byte_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	GPIO_Byte_TypeDef_ptr = (GPIO_Byte_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) GPIO_Byte_TypeDef_ptr->FIOMASK[4]);
		writeUSBOutString(str);
		return 0;
	}

	GPIO_Byte_TypeDef_ptr->FIOMASK[4] = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

