robovero/firmware/src/wrap/_lpc17xx_gpio.c
int _GPIO_Byte_TypeDef_FIOPIN[4](uint8_t * args)
{
	uint8_t * arg_ptr;
	GPIO_Byte_TypeDef* GPIO_Byte_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	GPIO_Byte_TypeDef_ptr = (GPIO_Byte_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) GPIO_Byte_TypeDef_ptr->FIOPIN[4]);
		writeUSBOutString(str);
		return 0;
	}

	GPIO_Byte_TypeDef_ptr->FIOPIN[4] = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _GPIO_Byte_TypeDef_FIOSET[4](uint8_t * args)
{
	uint8_t * arg_ptr;
	GPIO_Byte_TypeDef* GPIO_Byte_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	GPIO_Byte_TypeDef_ptr = (GPIO_Byte_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) GPIO_Byte_TypeDef_ptr->FIOSET[4]);
		writeUSBOutString(str);
		return 0;
	}

	GPIO_Byte_TypeDef_ptr->FIOSET[4] = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _GPIO_Byte_TypeDef_FIOCLR[4](uint8_t * args)
{
	uint8_t * arg_ptr;
	GPIO_Byte_TypeDef* GPIO_Byte_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	GPIO_Byte_TypeDef_ptr = (GPIO_Byte_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	GPIO_Byte_TypeDef_ptr->FIOCLR[4] = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}*/

int _GPIO_HalfWord_TypeDef_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(GPIO_HalfWord_TypeDef)));
	writeUSBOutString(str);
	return 0;
}

int _GPIO_HalfWord_TypeDef_FIODIRL(uint8_t * args)
{
	uint8_t * arg_ptr;
	GPIO_HalfWord_TypeDef* GPIO_HalfWord_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	GPIO_HalfWord_TypeDef_ptr = (GPIO_HalfWord_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) GPIO_HalfWord_TypeDef_ptr->FIODIRL);
		writeUSBOutString(str);
		return 0;
	}

	GPIO_HalfWord_TypeDef_ptr->FIODIRL = (uint16_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _GPIO_HalfWord_TypeDef_FIODIRU(uint8_t * args)
{
	uint8_t * arg_ptr;
	GPIO_HalfWord_TypeDef* GPIO_HalfWord_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	GPIO_HalfWord_TypeDef_ptr = (GPIO_HalfWord_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) GPIO_HalfWord_TypeDef_ptr->FIODIRU);
		writeUSBOutString(str);
		return 0;
	}

	GPIO_HalfWord_TypeDef_ptr->FIODIRU = (uint16_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _GPIO_HalfWord_TypeDef_FIOMASKL(uint8_t * args)
{
	uint8_t * arg_ptr;
	GPIO_HalfWord_TypeDef* GPIO_HalfWord_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	GPIO_HalfWord_TypeDef_ptr = (GPIO_HalfWord_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) GPIO_HalfWord_TypeDef_ptr->FIOMASKL);
		writeUSBOutString(str);
		return 0;
	}

	GPIO_HalfWord_TypeDef_ptr->FIOMASKL = (uint16_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _GPIO_HalfWord_TypeDef_FIOMASKU(uint8_t * args)
{
	uint8_t * arg_ptr;
	GPIO_HalfWord_TypeDef* GPIO_HalfWord_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	GPIO_HalfWord_TypeDef_ptr = (GPIO_HalfWord_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) GPIO_HalfWord_TypeDef_ptr->FIOMASKU);
		writeUSBOutString(str);
		return 0;
	}

	GPIO_HalfWord_TypeDef_ptr->FIOMASKU = (uint16_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _GPIO_HalfWord_TypeDef_FIOPINL(uint8_t * args)
{
	uint8_t * arg_ptr;
	GPIO_HalfWord_TypeDef* GPIO_HalfWord_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	GPIO_HalfWord_TypeDef_ptr = (GPIO_HalfWord_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) GPIO_HalfWord_TypeDef_ptr->FIOPINL);
		writeUSBOutString(str);
		return 0;
	}

	GPIO_HalfWord_TypeDef_ptr->FIOPINL = (uint16_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _GPIO_HalfWord_TypeDef_FIOPINU(uint8_t * args)
{
	uint8_t * arg_ptr;
	GPIO_HalfWord_TypeDef* GPIO_HalfWord_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	GPIO_HalfWord_TypeDef_ptr = (GPIO_HalfWord_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) GPIO_HalfWord_TypeDef_ptr->FIOPINU);
		writeUSBOutString(str);
		return 0;
	}

	GPIO_HalfWord_TypeDef_ptr->FIOPINU = (uint16_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _GPIO_HalfWord_TypeDef_FIOSETL(uint8_t * args)
{
	uint8_t * arg_ptr;
	GPIO_HalfWord_TypeDef* GPIO_HalfWord_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	GPIO_HalfWord_TypeDef_ptr = (GPIO_HalfWord_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) GPIO_HalfWord_TypeDef_ptr->FIOSETL);
		writeUSBOutString(str);
		return 0;
	}

	GPIO_HalfWord_TypeDef_ptr->FIOSETL = (uint16_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _GPIO_HalfWord_TypeDef_FIOSETU(uint8_t * args)
{
	uint8_t * arg_ptr;
	GPIO_HalfWord_TypeDef* GPIO_HalfWord_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	GPIO_HalfWord_TypeDef_ptr = (GPIO_HalfWord_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) GPIO_HalfWord_TypeDef_ptr->FIOSETU);
		writeUSBOutString(str);
		return 0;
	}

	GPIO_HalfWord_TypeDef_ptr->FIOSETU = (uint16_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _GPIO_HalfWord_TypeDef_FIOCLRL(uint8_t * args)
{
	uint8_t * arg_ptr;
	GPIO_HalfWord_TypeDef* GPIO_HalfWord_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	GPIO_HalfWord_TypeDef_ptr = (GPIO_HalfWord_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	GPIO_HalfWord_TypeDef_ptr->FIOCLRL = (uint16_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _GPIO_HalfWord_TypeDef_FIOCLRU(uint8_t * args)
{
	uint8_t * arg_ptr;
	GPIO_HalfWord_TypeDef* GPIO_HalfWord_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	GPIO_HalfWord_TypeDef_ptr = (GPIO_HalfWord_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	GPIO_HalfWord_TypeDef_ptr->FIOCLRU = (uint16_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

